RIET/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/ТипыТекстовЭлектронныхПисем/ТипыТекстовЭлектронныхПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТекстовЭлектронныхПисем</name>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>ПростойТекст</name>
  </enumValues>
  <enumValues>
    <name>РазмеченныйТекст</name>
  </enumValues>
  <enumValues>
    <name>HTMLСКартинками</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ColoursUpdater</name>
      <description>Colours updater</description>
    </items>
    <items>
      <name>ExportRequestsLoader</name>
      <description>Export requests loader</description>
    </items>
  </predefined>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>ShowNamesAndDescriptionsRUS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаПодписи</name>
    <type>
      <types>CatalogRef.ПользователиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>EMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Borgs</name>
    <attributes>
      <name>Borg</name>
      <type>
        <types>CatalogRef.BORGs</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникКонтактныеЛица</name>
      <description>Контактная информация справочника &quot;Контактные лица&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникОсновныеСредства</name>
      <description>Контактная информация справочника &quot;Основные средства&quot;</description>
    </items>
    <items>
      <name>СправочникПодразделенияОрганизаций</name>
      <description>Контактная информация справочника &quot;Подразделения организаций&quot;</description>
    </items>
    <items>
      <name>СправочникПолучателиРассылокОтчетов</name>
      <description>Контактная информация справочника &quot;Получатели рассылок отчетов&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
    <items>
      <name>ИнформАдресФизЛица</name>
      <description>Адрес для информирования физ. лица</description>
    </items>
    <items>
      <name>ДляИнвойсаАдресКонтрагента</name>
      <description>Адрес контрагента для инвойса</description>
    </items>
    <items>
      <name>АнглийскийАдресКонтрагента</name>
      <description>Адрес контрагента по-английски</description>
    </items>
    <items>
      <name>ДляИнвойсаАдресОрганизации</name>
      <description>Адрес организации для инвойса</description>
    </items>
    <items>
      <name>АнглийскийАдресОрганизации</name>
      <description>Адрес организации по-английски</description>
    </items>
    <items>
      <name>ЮрАдресФизЛица</name>
      <description>Адрес по прописке физ. лица</description>
    </items>
    <items>
      <name>ФактАдресФизЛица</name>
      <description>Адрес проживания физ. лица</description>
    </items>
    <items>
      <name>ИнострАдресФизЛица</name>
      <description>Адрес физ. лица за пределами РФ </description>
    </items>
    <items>
      <name>АдресОрганизацииПочтовый</name>
      <description>Почтовый адрес организации</description>
    </items>
    <items>
      <name>СлужебныйАдресЭлектроннойПочтыПользователя</name>
      <description>Служебный адрес электронной почты пользователя</description>
    </items>
    <items>
      <name>ТелефонФизЛица</name>
      <description>Телефон физ. лица</description>
    </items>
  </predefined>
  <attributes>
    <name>АдресТолькоРоссийский</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъектаКонтактнойИнформации</name>
    <type>
      <types>EnumRef.ВидыОбъектовКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещатьВводНекорректного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МногострочноеПоле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/CommonForms/RegistrationForRequestorInLocalDistributionForNonLawsonCompanies/Module.bsl
//////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// ПРИ СОЗДАНИИ НА СЕРВЕРЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	SupportEmailAddress = "riet-support-ld@slb.com";
	LinkForRegisteredUsers = "http://ru0149app35.dir.slb.com/RIET";
	
	Элементы.ГруппаRegistered.Видимость = Ложь;	
	Элементы.ГруппаAlreadyRegistered.Видимость = Ложь;
	Элементы.ГруппаError.Видимость = Ложь;	
	// { RG-Soft LGoncharova 12.11.2018 S-I-0006256
	Элементы.ГруппаОшибка.Видимость = Ложь;	
	// } RG-Soft LGoncharova 12.11.2018 S-I-0006256
	
КонецПроцедуры

// { RG-Soft LGoncharova 12.11.2018 S-I-0006256
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПоказатьФормуПредупреждения();
КонецПроцедуры
&НаКлиенте
Процедура ПоказатьФормуПредупреждения()
	__ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПредупреждения",ЭтаФорма , "СогласиеНаРегистрацию");
	ОткрытьФорму("ОбщаяФорма.rgsФормаПредупрежденияПриРегистрации",, ЭтаФорма,,,,__ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПРоцедуры
&НаКлиенте
Процедура ОбработкаПредупреждения(СтатусВозврата, ИмяПараметра) Экспорт
	Если ИмяПараметра = "СогласиеНаРегистрацию" И НЕ СтатусВозврата = Истина Тогда
		Элементы.ГруппаRegister.ТолькоПросмотр 				 = Истина;
		Элементы.ГруппаLinkForRegisteredUsers.ТолькоПросмотр = Истина;
		Элементы.Register.Доступность 						 = Ложь;
		Элементы.ГруппаRegistered.Видимость 		= Ложь;
		Элементы.ГруппаAlreadyRegistered.Видимость 	= Ложь;
		Элементы.ГруппаError.Видимость 				= Ложь;
		Элементы.ГруппаОшибка.Видимость 			= Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры
// } RG-Soft LGoncharova 12.11.2018 S-I-0006256

//////////////////////////////////////////////////////////////////////
// РЕГИСТРАЦИЯ

&НаКлиенте
Процедура Register(Команда)
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Alias)) Тогда
		Предупреждение("Fill in alias, please / Заполните имя, пожалуйста");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(ВыборЯзыка)) Тогда
		Предупреждение("Select language, please / Выберите язык заполнения, пожалуйста");
		Возврат;
	КонецЕсли;

	RegisterНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура RegisterНаСервере()
	
	СтруктураВозврата = CreateUpdateUser();
	
	Если СтруктураВозврата.Результат = "Registered" Тогда
		
		Элементы.ГруппаRegister.Видимость = Ложь;
		Элементы.ГруппаRegistered.Видимость = Истина;
		
	ИначеЕсли СтруктураВозврата.Результат = "AlreadyRegistered" Тогда
		
		Элементы.ГруппаRegister.Видимость = Ложь;
		Элементы.НадписьAUserWithTeAlias.Заголовок = СтрЗаменить(Элементы.НадписьAUserWithTeAlias.Заголовок, "%1", Alias);
		Элементы.ГруппаAlreadyRegistered.Видимость = Истина;	
				
	Иначе
		
		Элементы.НадписьErrorDescription.Заголовок = СтруктураВозврата.Описание;
		Элементы.ГруппаError.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// ДОДЕЛАТЬ
&НаСервере
Функция CreateUpdateUser()
	
	// ВЫНЕСТИ ЧАСТЬ ЛОГИКИ В МОДУЛЬ МЕНЕДЖЕРА СПРАВОЧНИКА ПОЛЬЗОВАТЕЛИ
	
	СтруктураВозврата = Новый Структура("Результат, Описание");
	
	// пока для всех DIR
	//Domain = СокрЛП(Domain);
	//Domain = НРег(Domain);
	Domain = "dir";
	
	Alias = СокрЛП(Alias);	
	Если СтрДлина(СокрЛП(Alias)) > 2 Тогда 
		Alias = ВРег(Сред(СокрЛП(Alias), 1, 2)) + НРег(Сред(СокрЛП(Alias), 3));
	иначе
		Alias = ВРег(СокрЛП(Alias));
	КонецЕсли;
	Alias = СтрЗаменить(Alias, "@slb.com", "");
	НовыйПользовательОС = "\\" + Domain + "\" + Alias;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Проверим - не зарегистрирован ли пользователь 
	МассивПользователейИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого ПользовательИБ Из МассивПользователейИБ Цикл
		
		ПользовательОСПользователяИБ = СокрЛП(ПользовательИБ.ПользовательОС);
		Если Прав(ПользовательОСПользователяИБ, 1) = "\" Тогда // Срезаем последний слеш, если есть
			ПользовательОСПользователяИБ = Лев(ПользовательОСПользователяИБ, СтрДлина(ПользовательОСПользователяИБ)-1);
		КонецЕсли;
		
		// А ЕСЛИ ЗДЕСЬ НЕ 3 А 2 ИЛИ БОЛЬШЕ БУКВ?
		AliasТекущегоПользователяИБ = Сред(ПользовательОСПользователяИБ, 7); // Срезаем \\DIR\	
		
		Если НРег(AliasТекущегоПользователяИБ) = Alias Тогда
			
			Если НРег(ПользовательОСПользователяИБ) = НРег(НовыйПользовательОС) Тогда
				
				СтруктураВозврата.Результат = "AlreadyRegistered";
				Возврат СтруктураВозврата;
				
			Иначе
				
				ПользовательИБ.ПользовательОС = НовыйПользовательОС;
				Попытка
					ПользовательИБ.Записать();
				Исключение
					
					ЗаписьЖурналаРегистрации(
						"Ошибка обновления данных пользователя ИБ",
						УровеньЖурналаРегистрации.Ошибка,
						Метаданные.ОбщиеФормы.RegistrationInImportExportTracking,
						,
						"Не удалось установить пользователя ОС """ + НовыйПользовательОС + """ у пользователя ИБ """ + ПользовательИБ.Имя + """: " + ОписаниеОшибки());
						
					СтруктураВозврата.Результат = "Error";
					СтруктураВозврата.Описание = "Failed to update an existing user / Не удалось обновить существующего пользователя";
					Возврат СтруктураВозврата;
					
				КонецПопытки;
				
				СтруктураВозврата.Результат = "AlreadyRegistered";
				Возврат СтруктураВозврата;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Создадим нового пользователя: пользователя в справочнике Пользователи и пользователя ИБ
	НачатьТранзакцию();
	        		
	// Пользователя ИБ
	ПользовательИБ = УправлениеПользователями.НайтиПользователяБД(СокрЛП(Alias));
	Если ПользовательИБ = Неопределено Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	КонецЕсли;
	ПользовательИБ.АутентификацияОС = Истина;
	ПользовательИБ.АутентификацияСтандартная = Ложь;
	ПользовательИБ.Имя = Alias;
	ПользовательИБ.ПоказыватьВСпискеВыбора = Ложь;
	ПользовательИБ.ПолноеИмя = Alias;
	ПользовательИБ.ПользовательОС = НовыйПользовательОС;
	ПользовательИБ.РежимЗапуска = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение;
	ПользовательИБ.Роли.Добавить(Метаданные.Роли.LocalDistributionRequestor_ForNonLawsonCompanies);
	ПользовательИБ.Язык = ?(ВыборЯзыка = "RU", Метаданные.Языки.Русский, Метаданные.Языки.Английский);
	Попытка
		ПользовательИБ.Записать();
	Исключение
			
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(
			"Ошибка создания пользователя ИБ",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеФормы.RegistrationInImportExportTracking,
			,
			"Не удалось записать пользователя ИБ """ + ПользовательИБ.Имя + """: " + ОписаниеОшибки());
			
		СтруктураВозврата.Результат = "Error";
		СтруктураВозврата.Описание = "Failed to create a new user / Не удалось создать нового пользователя";
		Возврат СтруктураВозврата;
		
	КонецПопытки;
	
	// Элемент в справочнике Пользователи
	ПользовательСсылка = Справочники.Пользователи.НайтиПоКоду(Alias);
	Если ЗначениеЗаполнено(ПользовательСсылка) Тогда 
		ПользовательОбъект = ПользовательСсылка.ПолучитьОбъект();
		ПользовательОбъект.ПометкаУдаления = Ложь;
	иначе
		ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
		ПользовательОбъект.Код = Alias;
	КонецЕсли;
	ПользовательОбъект.Наименование = Alias;
	
	EMail = СокрЛП(Alias) + "@slb.com";
	ПользовательОбъект.EMail = EMail;
	ПользовательОбъект.КонтактнаяИнформация.Очистить();
	СтрКИ = ПользовательОбъект.КонтактнаяИнформация.Добавить();
	СтрКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	СтрКИ.АдресЭП = EMail;
	СтрКИ.Представление = EMail;
	СтрКИ.Вид = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("E-mail",,Справочники.ВидыКонтактнойИнформации.СправочникПользователи);
	СтрКИ.ДоменноеИмяСервера = Сред(EMail, СтрНайти(EMail, "@") + 1);

	Попытка
		ПользовательОбъект.Записать();
	Исключение
		
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(
			"Ошибка создания пользователя",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеФормы.RegistrationInImportExportTracking,
			,
			"Не удалось записать нового пользователя """ + СокрЛП(ПользовательОбъект.Код) + """: " + ОписаниеОшибки());
			
		СтруктураВозврата.Результат = "Error";
		СтруктураВозврата.Описание = "Failed to create a new user / Не удалось создать нового пользователя";
		
		Возврат СтруктураВозврата;
		
	КонецПопытки;
	
	ГруппаДоступа = Справочники.ГруппыДоступа.LocalDistributionRequestors.ПолучитьОбъект();
	СтрокаПользователи = ГруппаДоступа.Пользователи.Добавить();
	СтрокаПользователи.Пользователь = ПользовательОбъект.Ссылка;
	ГруппаДоступа.Пользователи.Свернуть("Пользователь");
	ГруппаДоступа.Записать();
	
	ЗафиксироватьТранзакцию();
	
	// Отправим пользователю почтовое сообщение
	СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому", Alias + "@slb.com");	
	ПараметрыПисьма.Вставить("Тема", "Registration of the requestor / Регистрация заявителя");
	ПараметрыПисьма.Вставить("Тело",
		"Congratulations!
		|
		|You have successfully registered in 1c-Local distribution application.
		|
		|Use this link http://ru0149app35.dir.slb.com/RIET to access the system.
		|
		|Comments and suggestions are welcomed on riet-support-ld@slb.com
		|
		|-----------------------------------------------------------------------------
		|
		|Поздравляем!
		|
		|Вы успешно зарегистрированы в 1с-приложении для учета локальной доставки.
		|
		|Используйте ссылку http://ru0149app35.dir.slb.com/RIET для входа в систему.
		|
		|Пожалуйста, присылайте вопросы, комментарии и предложения на эл.адрес: riet-support-ld@slb.com
		|
		|
		|Best regards,
		|RG-Soft development team,
		|www.rg-soft.ru");
    ПараметрыПисьма.Вставить("АдресОтвета", "riet-support-ld@slb.com");
	ПараметрыПисьма.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
	
	Попытка
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыПисьма);
	Исключение
		ЗаписьЖурналаРегистрации(
			"Ошибка отправки почтового сообщения новому пользователю RIET",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеФормы.RegistrationInImportExportTracking,
			,
			"Не удалось отправить почтовое сообщение пользователю """ + ПараметрыПисьма.Кому + """: " + ОписаниеОшибки());
	КонецПопытки;
		
	СтруктураВозврата.Результат = "Registered";
	Возврат СтруктураВозврата;
	
КонецФункции
